<h3>Как пользоваться эмулятором?</h3>
<ul>
    <li>Задайте алфавит для нормальных алгоритмов Маркова.</li>
    <li>
        Введите слово в поле для ввода слова.
    </li>
    <li>
        Напишите программу.
    </li>
    <li>Нажмите кнопку "Начать заново".</li>
    <li>
        Нажмите кнопку "Запустить до конца" для выполнения
        алгоритма до состояния останова или кнопку
        "Сделать шаг" для выполнения одного шага.
    </li>
    <li>
        Если не получается разобраться, используйте
        подготовленный пример(ы).
    </li>
    <li>
        Текущий слово отображается выше входного слова.
    </li>
    <li>
        В левой части указывается исходная последовательность символов.
        В правой части последовательность символов, на которую необходимо заменить исходную.
    </li>
    <li>
        Последнее правило помечается в правой части символом "•".
    </li>
    <li>
        Пустыми символами является символ "Λ".
    </li>
    <li>
        Символом удаления является символ "_".
    </li>
</ul>
