<h3>Как пользоваться эмулятором?</h3>
<ul>
    <li>Задайте алфавит для МТ (машины Тьюринга).</li>
    <li>
        Введите слово на ленте,
        используя поле для ввода слова.
    </li>
    <li>
        Напишите программу.
    </li>
    <li>Нажмите кнопку "Начать заново".</li>
    <li>
        Нажмите кнопку "Запустить до конца" для выполнения
        алгоритма МТ до состояния останова или кнопку
        "Сделать шаг" для выполнения одного шага.
    </li>
    <li>
        Если не получается разобраться, используйте
        подготовленный пример.
    </li>
    <li>
        Текущий символ отображается на ленте зелёным цветом.
    </li>
    <li>
        Для прокрутки ленты используйте символы "<" и ">" слева и справа от ленты.
    </li>
    <li>
        Есть 2 вида ввода программы: списочный и табличный.
    </li>
    <li>
        В списочном виде в левой части указывается исходные состояние и символ через пробел.
        В правой части указывается 3 элемента через пробел: символ замены, сдвиг, следующее состояние.
    </li>
    <li>
        В табличном виде в ячейках таблицы указывается 3 элемента через пробел: символ замены,
        сдвиг, следующее состояние.
    </li>
    <li>
        Сдвиг: это либо R (вправо), либо L (влево), либо H (сдвиг не осуществлять).
    </li>
    <li>
        В качестве конечного состояния используется символ Ω.
    </li>
    <li>
        Лента является однонаправленной. Символом, ограничивающим ленту слева, является символ ∂.
    </li>
    <li>
        Если необходимо выполнить только сдвиг, оставшись в том же состоянии,
        то достаточно записать только символ перемещения: L, H или R.
    </li>
</ul>
