<!DOCTYPE html>
<html lang="en">
<head>
    <title>Гёдель</title>

    <!-- BEGIN META -->
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="keywords" content="your,keywords">
    <meta name="description" content="Short explanation about this website">
    <!-- END META -->

    <!-- BEGIN STYLESHEETS -->
    {!! HTML::style('css/bootstrap.css') !!}
    {!! HTML::style('css/materialadmin.css') !!}
    {!! HTML::style('css/font-awesome.min.css') !!}
    {!! HTML::style('css/material-design-iconic-font.min.css') !!}
    <!-- END STYLESHEETS -->

    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    {!! HTML::script('js/libs/utils/html5shiv.js') !!}
    {!! HTML::script('js/libs/utils/respond.min.js') !!}
    <![endif]-->


</head>
<body>
<section>

<div class="col-md-12 col-sm-6 card style-primary text-center">
    <h1 class="text-default-bright">Библиотека</h1>
</div>

<!-- BEGIN CONTENT-->
<div id="content">

    <!-- BEGIN BLANK SECTION -->
    <section>
        <div class="section-header">
            <ol class="breadcrumb">
                <li>{!! HTML::linkRoute('home', 'Главная') !!}</li>
                <li>{!! HTML::linkRoute('library_index', 'Библиотека') !!}</li>
                <li>{!! HTML::linkRoute('library_persons', 'Персоналии') !!}</li>
                <li class="active">Гёдель</li>
            </ol>
        </div><!--end .section-header -->
    </section>
    <div class="card card-tiles style-default-light" style="margin-left:2%; margin-right:2%">
        <article class="style-default-bright">
            <div class="card-body">
	<article class="style-default-bright">
		<div class="card-body"> 
		<article style="margin-left:10%; margin-right:10%; text-align: justify">
			

<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <strong>Курт Фри́дрих Гёдель</strong> &mdash; австрийский логик, математик и философ математики, наиболее известный сформулированной и доказанной им теоремой о неполноте.</p>

<p>{!! HTML::image('img/library/persons/gedel1.jpg', 'gedel', array('style' => 'float:left; height:408px; width:328px')) !!}Курт Гёдель родился 28 апреля 1906&nbsp;года в австро-венгерском (моравском) городе Брюнн (ныне Брно, Чехия), в немецкой семье. Его отец, австрийский немец Рудольф Гёдель, был владельцем крупнейшей текстильной фабрики в городе Брюнн (Брно). Мать Курта - Марианна Хандшу училась во Франции и получила гуманитарное образование.</p>

<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Окончив школу в 1923 году, Курт поступил в Венский университет. Однако к тому времени он так и не решил, в какой области будет специализироваться, &ndash; в математике или теоретической физике. В университете он слушал лекции таких выдающихся профессоров математики, как Филипп Фуртвенглер, Ханс Хан, Вильгельм Виртингер, Карл Менгер и других. Особое влияние на юного Геделя оказали лекции Фуртвенглера, и он выбрал математику в качестве специализации. Тому было две причины: во-первых, Фуртвенглер был выдающимся математиком и преподавателем; во-вторых, он был парализован и читал лекции сидя на инвалидном кресле, в то время как его ассистент делал записи на доске. Это произвело на Геделя особенно сильное впечатление.</p>

<p>В 1929 Курт Гёдель защитил докторскую диссертацию по математике, в которой доказал полноту исчисления предикатов первой ступени. В этом же году умер отец Гёделя. У него был хороший бизнес, поэтому после его смерти семья осталась финансово обеспечена. После смерти мужа мать Гёделя купила большую квартиру в Вене, где поселилась с двумя сыновьями. В 1930 году Гёдель стал преподавать в Венском университете, где принадлежал к школе логического позитивизма до 1938 года. Он был одним из главных участников Венского кружка &ndash; философского объединения, где были разработаны основы логического позитивизма. Кружок сложился еще в 1922 году вокруг австрийского физика М. Шлика &ndash; профессора Венского университета Шлика, семинары которого вызвали интерес Геделя к логике.</p>

<p>Наиболее известное достижение Гёделя&nbsp;&mdash; это сформулированные и доказанные им теоремы о неполноте, опубликованные в 1931 году. Одна из них гласит, что любая эффективно аксиоматизируемая теория, в богатом языке, достаточном для определения натуральных чисел и операций сложения и умножения, является неполной либо противоречивой. Неполнота означает наличие высказываний, которые нельзя ни доказать, ни опровергнуть, исходя из аксиом этой теории. Для ее доказательства или опровержения требуются дополнительные аксиомы (усиление системы). Противоречивость&nbsp;&mdash; возможность доказать любое высказывание: как истинное, так и ложное. Эффективная аксиоматизируемость понимается как возможность алгоритмически решить, является ли данное утверждение аксиомой.</p>

<p>В 1933-1938 - приват-доцент Венского университета.</p>

<p>В 1934 году совершил поездку в США (Принстонский университет), где прочитал курс лекций &laquo;О неразрешимых теоремах формальных математических систем&raquo;. Впоследствии тезисы этих лекций были опубликованы. По возвращении в Европу вследствие интенсивной интеллектуальной деятельности Курт Гёдель начал страдать нервным расстройством. Несмотря на проблемы со здоровьем, Гедель продолжал свои исследования, в которых доказывал согласованность аксиомы выбора с другими аксиомами теории набора. Однако вскоре его ждал новый удар. Он был связан с внезапным убийством профессора Шлика.</p>

<p>&ldquo;Это происшествие, несомненно, послужило причиной серьезного нервного расстройства брата, что вызвало беспокойство матери. Вскоре после выздоровления его пригласили работать в США&rdquo;, &ndash; писал его брат Рудольф.</p>

<p>В марте 1938 года Австрия была присоединена к Германии, но Гёделя это не интересовало. Он во второй раз побывал в Принстоне, где работал в Институте высших исследований (the Institute for Advanced Study), а вторую часть учебного года провел во Франции, где прочел курс лекций. После присоединения Австрии к Германии большинство ученых, носивших степень приват-доцента, стали получать жалование за лекции. Гедель такого жалования не получал, так как многие полагали, что он еврей. Это было неправдой, хотя у Геделя действительно было много друзей евреев.</p>

<p>{!! HTML::image('img/library/persons/gedel2.jpg', 'gedel', array('style' => 'float:left; height:340px; width:256px')) !!}Летом 1938 года Гедель отправился в Геттинген, где читал лекции о своих исследованиях в области теории набора. Осенью того же года он вернулся в Вену и женился на Адель Поркерт, с которой познакомился еще в 1927 году в одном из венских ночных клубов. Она была на шесть лет старше и разведена с первым мужем. Родители Геделя, и особенно его отец, всегда были против этой свадьбы.</p>

<p>{!! HTML::image('img/library/persons/gedel3.jpg', 'gilbert', array('style' => 'float:left; height:381px; width:242px')) !!}Когда началась война, Гедель боялся, что его призовут в армию. Конечно, он был убежден, что слишком слаб здоровьем, чтобы служить, но если его по ошибке принимали за еврея, его также могли по ошибке принять за здорового человека. Он не хотел рисковать и после длительных переговоров о получении американской визы в 1940 году выехал в США вместе с женой. Причём из-за опасности пути через Атлантику во время войны поехал через СССР и Японию. В США он получил работу в знаменитом Институте перспективных исследований (Принстонский университет). Также Гедель продолжил свою научную работу в области теории набора, которая имела огромное значение. Его шедевр &ldquo;Согласованность аксиомы выбора и обобщенной континуум-гипотезы с аксиомами теории набора&rdquo; (1940) стал классикой современной математики. В этой работе он доказал, что если аксиоматическая система теории набора, построенная по типу, предложенному Расселом и Уайтхедом в &ldquo;Principia Mathematicа&rdquo;, последовательна, то она останется таковой в случае если аксиома выбора и обобщенная континуум-гипотеза будут добавлены к системе. В 1951 году Гёдель получил высшую научную награду США&nbsp;&mdash; Эйнштейновскую премию, а в 1974 году&nbsp;&mdash; Национальную медаль науки.</p>

<p>С 1953 и до конца жизни - профессор Принстонского института перспективных исследований.</p>

<p>{!! HTML::image('img/library/persons/gedel4.jpg', 'gilbert', array('style' => 'float:left; height:563px; width:750px')) !!}</p>

<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ещё с 1930-х годов у Гёделя обнаруживались признаки психических проблем, которые обычно носили скрытый характер, проявляясь в частых беспокойствах и излишней подозрительности, но в периоды обострений принимали более явные, навязчивые формы. Так, в 1936 году у него развился параноидальный страх отравления. Опорой Гёделя в нелёгкое время была его жена Адель, кормившая его с ложки и буквально выходившая мужа. Из сохранившихся записей библиотечных запросов этого периода известно, что он изучал литературу по душевным расстройствам, фармакологии и токсикологии (особенно характерно неоднократное обращение к техническому справочнику по отравлениям угарным газом), что лишь осложняло впоследствии его лечение.</p>

<p>Позже, в Принстоне (1941), несмотря на улучшение общего состояния, Гёдель по-прежнему испытывал дискомфорт от присутствия агрегатов, способных, по его мнению, испускать отравляющие газы. По этой причине он даже распорядился вынести из их с Аделью квартиры холодильник и радиатор. Его одержимость свежим воздухом и подозрения по поводу холодильника сохранялись до конца жизни, а периоды умеренного оздоровления и ухудшения душевного состояния сменяли друг друга. Последние, впрочем, происходили всё чаще и были тяжелее. Так, кризис 1970-го года оказался гораздо хуже такового в 1936-м и сопровождался галлюцинациями, параноидальным поведением по отношению к докторам и коллегам. Стремительно ухудшалось и состояние здоровья Адель, теперь она не могла ухаживать за ним так, как раньше, а он, в свою очередь,&nbsp;&mdash; за ней. Огромную поддержку оказывал друг Гёделя Оскар Моргенштерн.</p>

<p>{!! HTML::image('img/library/persons/gilbert.jpg', 'gilbert', array('style' => 'float:left; height:3790px; width:284px')) !!}В феврале 1976&nbsp;года паранойя Гёделя опять обострилась, начал снижаться вес, и его уговорили на госпитализацию. Однако уже через неделю, даже не выписавшись, он вернулся домой. Подозрения касались теперь и жены&nbsp;&mdash; Моргенштерну и другим людям он рассказывал, что та якобы раздала в его отсутствие все его деньги. В июне Адель была госпитализирована (до августа). Гёдель проводил с ней, по-видимому, достаточно много времени и плохо питался. Осенью он ненадолго снова попал в больницу, где, как он сообщил, его якобы пытались убить. После возвращения домой состояние не улучшалось. Несмотря на уговоры друзей, от очередной госпитализации он отказывался.</p>

<p>В июле 1977&nbsp;года Адель вновь попала в больницу, где пробыла до декабря. 26 июля умер Моргенштерн. Это событие и отсутствие жены оказали решающее влияние на состояние Гёделя в последующие несколько месяцев&nbsp;&mdash; анорексия и паранойя прогрессировали всё активнее. 29 декабря, следуя настояниям жены, возвратившейся около недели до того, Гёдель согласился на госпитализацию. Однако врачи никакую существенную помощь оказать уже не могли. Учёный скончался от &laquo;недоедания и истощения&raquo;, индуцированных &laquo;расстройством личности&raquo;, 14 января 1978&nbsp;года в Принстоне, штат Нью-Джерси.</p>

<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Гедель внес важный вклад в теорию множеств. Два принципа - аксиома выбора и континуум-гипотеза - на протяжении десятилетий не поддавались доказательству, но интерес к ним не ослабевал: слишком привлекательны были их логические следствия. Гедель доказал (1938), что присоединение этих принципов к обычным аксиомам теории множеств не приводит к противоречию. Его рассуждения ценны не только теми результатами, которые они позволяют получить; Гедель разработал конструкцию, которая улучшает понимание внутренних механизмов самой теории множеств.</p>

			</article></article>	</div></div>

    {!! HTML::script('js/libs/jquery/jquery-1.11.2.min.js') !!}
    {!! HTML::script('js/libs/jquery/jquery-migrate-1.2.1.min.js') !!}
    {!! HTML::script('js/libs/bootstrap/bootstrap.min.js') !!}
    {!! HTML::script('js/libs/spin.js/spin.min.js') !!}
    {!! HTML::script('js/libs/autosize/jquery.autosize.min.js') !!}
    {!! HTML::script('js/libs/nanoscroller/jquery.nanoscroller.min.js') !!}
    {!! HTML::script('js/core/source/App.js') !!}
    {!! HTML::script('js/core/source/AppNavigation.js') !!}
    {!! HTML::script('js/core/source/AppOffcanvas.js') !!}
    {!! HTML::script('js/core/source/AppCard.js') !!}
    {!! HTML::script('js/core/source/AppForm.js') !!}
    {!! HTML::script('js/core/source/AppNavSearch.js') !!}
    {!! HTML::script('js/core/source/AppVendor.js') !!}
    {!! HTML::script('js/core/demo/Demo.js') !!}
    <!-- END JAVASCRIPT -->
</section>
</body>
</html>