<!DOCTYPE html>
<html lang="en">
<head>
    <title>Гилберт</title>

    <!-- BEGIN META -->
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="keywords" content="your,keywords">
    <meta name="description" content="Short explanation about this website">
    <!-- END META -->

    <!-- BEGIN STYLESHEETS -->
    {!! HTML::style('css/bootstrap.css') !!}
    {!! HTML::style('css/materialadmin.css') !!}
    {!! HTML::style('css/font-awesome.min.css') !!}
    {!! HTML::style('css/material-design-iconic-font.min.css') !!}
    <!-- END STYLESHEETS -->

    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    {!! HTML::script('js/libs/utils/html5shiv.js') !!}
    {!! HTML::script('js/libs/utils/respond.min.js') !!}
    <![endif]-->


</head>
<body>
<section>

<div class="col-md-12 col-sm-6 card style-primary text-center">
    <h1 class="text-default-bright">Библиотека</h1>
</div>

<!-- BEGIN CONTENT-->
<div id="content">

    <!-- BEGIN BLANK SECTION -->
    <section>
        <div class="section-header">
            <ol class="breadcrumb">
                <li>{!! HTML::linkRoute('home', 'Главная') !!}</li>
                <li>{!! HTML::linkRoute('library_index', 'Библиотека') !!}</li>
                <li>{!! HTML::linkRoute('library_persons', 'Персоналии') !!}</li>
                <li class="active">Гилберт</li>
            </ol>
        </div><!--end .section-header -->
    </section>
    <div class="card card-tiles style-default-light" style="margin-left:2%; margin-right:2%">
        <article class="style-default-bright">
            <div class="card-body">
	<article class="style-default-bright">
		<div class="card-body"> 
		<article style="margin-left:10%; margin-right:10%; text-align: justify">
			
<p>{!! HTML::image('img/library/persons/gilbert1.jpg', 'gilbert', array('style' => 'float:left; height:308px; width:228px')) !!}Давид Гильберт родился 23 января 1862 в городе Велау близ Кёнигсберга (ныне Калининград, Россия) в семье окружного судьи. Он получил хорошее домашнее образование, &nbsp;поступил в гимназию Фридрихсколлег, а в 1879 перешел в Вильгельм-гимназию.<br />
В 1880 г. по окончании гимазии Давид Гильберт поступил в Кёнигсбергский университет, однако, вопреки желанию отца, записался не на юридический, а на математический курс.<br />
В университете Давид Гильберт подружился с известными учеными Германом Минковским и Адольфом Гурвицем. Вместе они часто совершали долгие &laquo;математические прогулки&raquo;, где деятельно обсуждали решение научных проблем.<br />
Позже Гильберт писал, что свободное общение с Гурвицем и Минковским дало ему значительно больше, чем долгое сидение над книгами.<br />
В феврале 1885 Гильберт защитил докторскую диссертацию О базисе в пространстве инвариантов, а в мае по настоянию Адольфа Гурвица отправился в Лейпциг, где посещал лекции Клейна и принимал участие в его семинаре.<br />
В марте 1886 по совету Феликса Клейна он отправился на семинар в Париж, где прослушал лекции Пуанкаре, Пикара, Эрмита, Жордана. Вернувшись в Кёнигсберг, Гильберт представил габилитационные тезисы и прочел лекцию на факультете, после чего получил титул профессора и право читать лекции в университете.</p>

<p>Гильберт был известен как блестящий лектор, умеющий ясно и доходчиво объяснить студентам самые трудные задачи. Он считал, что настоящая наука делается не в тиши кабинетов, а в шумных студенческих аудиториях, где путем вопросов и ответов находится истина.<br />
Слава о лекциях Гильберта распространилась по всей Германии, и сразу после защиты докторской диссертации он получает приглашение стать профессором известнейшего в стране Гёттингенского университета. Инициатива исходила от его давнего друга немецкого математика Ф.Клейна. Он прекрасно понимал, что Гильберт обладал большим научным потенциалом, который не смог бы развернуться в рамках провинциального университета, каким в то время был Кёнигсбергский. Поэтому Клейн и убедил Гильберта переехать в Гёттинген. Здесь ученый проработал всю оставшуюся жизнь.<br />
Возглавив кафедру, которую до него занимали великие немецкие математики Карл Гаусс и Георг Риман, Гильберт стал достойным продолжателем их традиций. Его творчество охватывало практически все отрасли математики. Обычно ученый выделял какую-либо одну область, над которой напряженно работал в течение нескольких лет.<br />
В 1900 году, выступая на Международном математическом конгрессе, Давид Гильберт огласил знаменитый список из 23 нерешённых проблем математики.<br />
Когда эти проблемы были сформулированы, выяснилось, что некоторые из них либо решены, либо близки к решению. Однако другие потребовали для своего решения несколько десятков лет и усилий многих выдающихся математиков, а две из них до сих пор не решены. Почему же Гильберт выбрал именно эти 23 проблемы? Чем он руководствовался, формулируя их?<br />
Сам Гильберт, поясняя свой выбор, приводил слова одного известного французского математика: &quot;Математическую теорию можно считать совершенной только тогда, когда ты сделал ее настолько ясной, что берешься изложить ее содержание первому встречному&quot;.<br />
Выбирая проблемы для своего доклада, Гильберт придерживался следующих принципов. Он говорил, что задача должна быть:<br />
&nbsp;а) понятной (должно быть ясно, откуда она возникла);&nbsp;<br />
б) достаточно трудной, чтобы вызывать интерес;&nbsp;<br />
в) но не настолько трудной, чтобы ее невозможно было решить.<br />
Это наиблее яркая и запоминающаяся страница биографии великого немецкого ученого. Однаку мировую славу ему принесло не только это выступление. Фундаментальные открытия Гильберта в теории инвариантов выдвинули его в первые ряды европейских математиков.<br />
В 1910-х годах Гильберт создал в современном виде функциональный анализ, введя понятие, получившее название гильбертова пространства.<br />
&nbsp;В физике Гильберт был сторонником строгого аксиоматического подхода, и считал, что после аксиоматизации математики необходимо будет проделать эту процедуру с физикой.<br />
Наиболее известным вкладом Гильберта в физику является вывод уравнений Эйнштейна &mdash; основных уравнений общей теории относительности, проведённый им в ноябре 1915 года практически одновременно с Эйнштейном (см. об этом: Гильберт и уравнения гравитационного поля). Фактически Гильберт первым получил правильные уравнения поля общей теории относительности, хотя опубликовал их позже. Кроме того, неоспоримо существенное влияние Гильберта на Эйнштейна в период их параллельной работы над выводом этих уравнений (оба находились в этот период в интенсивной переписке).<br />
Независимо от вопроса о приоритете, Гильберт первым использовал при выводе этих уравнений вариационный метод, ставший впоследствии одним из основных в теоретической физике. Очевидно, это был первый в истории физики случай, когда неизвестные до этого уравнения фундаментальной теории были получены таким путем (по крайней мере, если говорить о подтвердившихся теориях).<br />
Представляет интерес также следующий случай: в 1926 году после создания матричной квантовой механики Макс Борн и Вернер Гейзенберг решили проконсультироваться у Гильберта, существует ли область математики, в которой применялся бы подобный формализм. Гильберт ответил им, что с похожимиматрицами он встречался, когда разбирал вопросы существования решений дифференциальных уравнений второго порядка в частных производных. Физикам показалось, что математик их не понял, и они решили не изучать далее этот вопрос. Менее чем через полгода Эрвин Шрёдингер создал волновую квантовую механику, основное уравнение которой &mdash; уравнение Шрёдингера, является уравнением второго порядка в частных производных, и доказал эквивалентность обоих подходов: старого матричного и нового волнового.<br />
Современники вспоминают Гильберта как человека жизнерадостного, чрезвычайно общительного и доброжелательного, отмечают его исключительное трудолюбие и научный энтузиазм.<br />
Известные математики отзывались о роли Давида Гильберта в математике так:<br />
Герман Вейль [7]:<br />
Наше поколение не выдвинуло ни одного математика, который мог бы сравниться с ним&hellip; Пытаясь разглядеть сквозь завесу времени, какое будущее нам уготовано, Гильберт поставил и рассмотрел двадцать три нерешённые проблемы, которые&hellip; действительно сыграли важную роль в развитии математики на протяжении последующих сорока с лишним лет. Любой математик, решивший одну из них, занимал почётное место в математическом сообществе.<br />
Мы, математики, часто оцениваем свои успехи мерой того, какие из гильбертовых проблем удалось ещё решить.<br />
Норберт Винер:<br />
Гильберт словно олицетворял собой лучшие традиции великих гениев прошлого... Необычайно острое абстрактное мышление сочеталось у него с поразительным умением не отрываться от конкретного физического смысла проблемы.<br />
Жан Дьёдонне:<br />
Возможно, Гильберт глубже влиял на математический мир не столько своими гениальными открытиями, сколько строением своего ума; он научил математиков мыслить аксиоматически, то есть стремиться каждую теорему свести к строжайшей логической схеме... Со своей интеллектуальной, всё более требовательной честностью, в страстной потребности понять, в неутомимом стремлении ко всё более единой, всё более чистой, лишённой лишнего науке Гильберт поистине воплощал идеал математика для межвоенного поколения.</p>

			</article></article>	</div></div>

    {!! HTML::script('js/libs/jquery/jquery-1.11.2.min.js') !!}
    {!! HTML::script('js/libs/jquery/jquery-migrate-1.2.1.min.js') !!}
    {!! HTML::script('js/libs/bootstrap/bootstrap.min.js') !!}
    {!! HTML::script('js/libs/spin.js/spin.min.js') !!}
    {!! HTML::script('js/libs/autosize/jquery.autosize.min.js') !!}
    {!! HTML::script('js/libs/nanoscroller/jquery.nanoscroller.min.js') !!}
    {!! HTML::script('js/core/source/App.js') !!}
    {!! HTML::script('js/core/source/AppNavigation.js') !!}
    {!! HTML::script('js/core/source/AppOffcanvas.js') !!}
    {!! HTML::script('js/core/source/AppCard.js') !!}
    {!! HTML::script('js/core/source/AppForm.js') !!}
    {!! HTML::script('js/core/source/AppNavSearch.js') !!}
    {!! HTML::script('js/core/source/AppVendor.js') !!}
    {!! HTML::script('js/core/demo/Demo.js') !!}
    <!-- END JAVASCRIPT -->
</section>
</body>
</html>