<!DOCTYPE html>
<html lang="en">
<head>
    <title>Марков</title>

    <!-- BEGIN META -->
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="keywords" content="your,keywords">
    <meta name="description" content="Short explanation about this website">
    <!-- END META -->

    <!-- BEGIN STYLESHEETS -->
    {!! HTML::style('css/bootstrap.css') !!}
    {!! HTML::style('css/materialadmin.css') !!}
    {!! HTML::style('css/font-awesome.min.css') !!}
    {!! HTML::style('css/material-design-iconic-font.min.css') !!}
    <!-- END STYLESHEETS -->

    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    {!! HTML::script('js/libs/utils/html5shiv.js') !!}
    {!! HTML::script('js/libs/utils/respond.min.js') !!}
    <![endif]-->


</head>
<body>
<section>

<div class="col-md-12 col-sm-6 card style-primary text-center">
    <h1 class="text-default-bright">Библиотека</h1>
</div>

<!-- BEGIN CONTENT-->
<div id="content">

    <!-- BEGIN BLANK SECTION -->
    <section>
        <div class="section-header">
            <ol class="breadcrumb">
                <li>{!! HTML::linkRoute('home', 'Главная') !!}</li>
                <li>{!! HTML::linkRoute('library_index', 'Библиотека') !!}</li>
                <li>{!! HTML::linkRoute('library_persons', 'Персоналии') !!}</li>
                <li class="active">Марков</li>
            </ol>
        </div><!--end .section-header -->
    </section>
    <div class="card card-tiles style-default-light" style="margin-left:2%; margin-right:2%">
        <article class="style-default-bright">
            <div class="card-body">
	<article class="style-default-bright">
		<div class="card-body"> 
		<article style="margin-left:10%; margin-right:10%; text-align: justify">
			

		<p><strong>Марков (мл.) Андрей Андреевич </strong>{!! HTML::image('img/library/persons/markov1.jpg', 'markov', array('style' => 'float:left; height:250px; width:188px')) !!}(1903&ndash;1979)</p>

<p><em>Родился 9(22) сентября 1903&nbsp;г., Санкт-Петербург.</em></p>

<p><em>Умер 13 октября 1979&nbsp;г., Москва.</em></p>

<p>Математик. Член-корреспондент АН СССР по Отделению физико-математических наук (математика) с 23&nbsp;октября 1953&nbsp;г.</p>

<p>Родился в семье А.&nbsp;А.&nbsp;Маркова (старшего). Унаследовал от отца выдающиеся математические способности и любовь к науке. Получил блестящее домашнее образование. Сначала поступил на химический факультет Петроградского университета, но с 3-го курса продолжил обучение на физическом отделении физико-математического факультета, который окончил в 1924&nbsp;г. В ту пору занимался теоретической физикой и прикладной геофизикой. В 1925&ndash;1928&nbsp;гг. обучался в аспирантуре Астрономического института. Диссертацию, представленную на соискание ученой степени кандидата физико-математических наук, защитил в 1928&nbsp;г.</p>

<p>&nbsp;В 1928&ndash;1935&nbsp;гг. А.&nbsp;А.&nbsp;Марков работал в Астрономическом институте. В 1933&ndash;1936&nbsp;гг. &mdash; старший научный сотрудник НИИ математики и механики ЛГУ. В 1935&nbsp;г. ему без защиты диссертации была присуждена ученая степень доктора физико-математических наук. Утвержден в звании профессора &nbsp;в 1936&nbsp;г. В 1933&ndash;1955&nbsp;гг. преподавал в Ленинградском государственном университете &mdash; профессор с 1936&nbsp;г.</p>

<p>В 1939&ndash;1953&nbsp;гг. А.&nbsp;А.&nbsp;Марков работал в ЛОМИ &mdash; старший научный сотрудник, заведующий лабораторией, заместитель директора в 1941&ndash;1953&nbsp;гг. (сначала по МИАН в целом, с 1943&nbsp;г. после реэвакуации из Казани &mdash; по ЛОМИ). В период Великой Отечественной войны работал в коллективе МИАН, эвакуированном в Казань. После реэвакуации возвратился в Ленинград.</p>

<p>В 1954&nbsp;г. А.&nbsp;А.&nbsp;Марков переехал в Москву. В 1954&ndash;1972&nbsp;гг. работал в МИАН &mdash; заведующий лабораторией в 1954&ndash;1972&nbsp;гг., несколько лет работал на посту заместителя директора.</p>

<p>С 1964&nbsp;г. до конца жизни А.&nbsp;А.&nbsp;Марков &mdash; заведующий лабораторией математической логики и структуры машин Вычислительного центра АН СССР. С 1959&nbsp;г. до конца жизни &mdash; профессор, заведующий кафедрой математической логики и теории алгоритмов механико-математического факультета МГУ. На руководимой им кафедре работал С.&nbsp;В.&nbsp;Яблонский.</p>

<p>Основные направления математических исследований А.&nbsp;А.&nbsp;Маркова &mdash; топология, топологическая алгебра, теория динамических систем, теория алгоритмов, математическая логика и конструктивная математика.</p>

<p>В ранний период творческой деятельности (в 1928&ndash;1935&nbsp;гг., когда работал в Астрономическом институте) А.&nbsp;А.&nbsp;Марков выполнил ряд работ по небесной механике, которые сохраняют значение до настоящего времени. Небесная механика естественным образом привела его к чисто математической проблематике.</p>

<p>Диапазон математических дисциплин, которые А.&nbsp;А.&nbsp;Марков охватил в процессе своего творчества, чрезвычайно широк &mdash; от аксиоматической теории множеств до теории пластичности. В начале 1930-х&nbsp;гг. выполнил цикл работ по общей теории динамических систем. Им впервые было сформулировано общее, не зависящее от дифференциальных уравнений, определение динамической системы &mdash; важнейшего понятия современной теоретической кибернетики.</p>

<p>В 1940&ndash;1946&nbsp;гг. А.&nbsp;А.&nbsp;Марков выполнил ряд работ по свободным топологическим группам. Им было получено доказательство неразрешимости проблемы гомеоморфизма в топологии.</p>

<p>В области математической логики А.&nbsp;А.&nbsp;Марков решил две знаменитые математические проблемы &mdash; проблему тождества для полугрупп (так называемая проблема Туэ) и проблему гомеоморфии в топологии. Создал рабочий аппарат, опирающийся на удачно выбранное им понятие нормальных алгоритмов (использовал название &laquo;алгорифмы&raquo;, теперь их принято называть алгоритмами Маркова). Показал, что это понятие обладает принципиальными и методическими достоинствами. Введенное им понятие выдержало испытание временем и прочно вошло в научный обиход как общей теории алгоритмов, так и теоретической кибернетики, в которой послужило источником точной постановки ряда проблем. Методика, разработанная А.&nbsp;А.&nbsp;Марковым при построении теории нормальных алгоритмов, в значительной степени предвосхитила приемы структурного программирования и технику верификации программ.</p>

<p>А.&nbsp;А.&nbsp;Марков получил ответ на вопрос об инверсионной сложности булевых функций и нашел минимальные контактно-вентильные схемы, реализующие симметрические булевы функции. Заложил основы теории сложности алгоритмов. Развил специальную конструктивную логику, учитывающую специфику конструктивных объектов.</p>

<p>А.&nbsp;А.&nbsp;Марков занимался также прикладными вопросами математической логики, в частности ее применением в теории вычислительных машин. Разработал терминологию для описания работы вычислительных машин. Имеет многочисленные работы в области криптографии. Наиболее известна &laquo;теорема Маркова&raquo;, которая классифицирует шифры, не распространяющие искажения.</p>

<p>&nbsp;</p>

<p>{!! HTML::image('img/library/persons/markov2.jpg', 'markov', array('style' => 'float:left; height:410px; width:269px; border: 2px solid #ff0000')) !!} border=" 2px solid #ff0000" />Андрей Андреевич Марков &mdash; автор многих научных публикаций, в числе которых:</p>

<ul>
	<li >Поверхностное распределение постоянного тока в случае наклонного проводящего слоя // Материалы Центр. н.-и. геол. ин-та. Геофизика, 1938, т.&nbsp;5;</li>
	<li>О свободных топологических группах // Изв. АН СССР. Сер. матем., 1945, т.&nbsp;9, вып.&nbsp;1;</li>
	<li>Основы алгебраической теории кос // Труды МИАН, 1945, т.&nbsp;16;</li>
	<li>О вариационных принципах в теории пластичности // ПММ, 1947, т.&nbsp;11, №&nbsp;3;</li>
	<li>Теория алгорифмов // Труды МИАН, 1951, т.&nbsp;38;</li>
	<li>Теория алгорифмов // Труды МИАН, 1954, т.&nbsp;42;</li>
	<li>Математическая логика и вычислительная математика // Вестник АН СССР, 1957, №&nbsp;8;</li>
	<li>Неразрешимость проблем гомеоморфии // ДАН СССР, 1958, т.&nbsp;121, №&nbsp;2;</li>
	<li>О конструктивной математике // Труды МИАН, 1962, т.&nbsp;67;</li>
	<li>О некоторых алгорифмах, связанных с системами слов // Изв. АН СССР. Сер. матем., 1963, т.&nbsp;27, №&nbsp;1;</li>
	<li>Что такое кибернетика? // Кибернетика, мышление, жизнь (1964);</li>
	<li>О нормальных алгорифмах, связанных с вычислением булевых функций // Изв. АН СССР. Сер. матем., 1967, т.&nbsp;31, №&nbsp;1 (в соавторстве);</li>
	<li>Об одном языке для описания работы вычислительных машин // Проблемы кибернетики, 1967, т.&nbsp;19 (в соавторстве).</li>
</ul>

<p>Автор монографий:</p>

<ul>
	<li>О логике конструктивной математики (1972);</li>
	<li>Лекции по математической логике: Учебное пособие (1973);</li>
	<li>Теория алгорифмов (1996 &mdash; 2-е изд., испр. и доп.) и&nbsp;др.</li>
</ul>

<p>Избранные труды: В 2-х т. &mdash; М.: 2002.</p>

<p>А.&nbsp;А.&nbsp;Марков основал большую и продуктивно работающую научную школу математической логики. С 1943&nbsp;г. руководил (совместно с С.&nbsp;Л.&nbsp;Яновской) в МГУ научным семинаром по математической логике. Его преемником в этой деятельности в дальнейшем стал П.&nbsp;С.&nbsp;Новиков.</p>

<p>С 1964&nbsp;г. до конца жизни А.&nbsp;А.&nbsp;Марков &mdash; член Научного совета по кибернетике АН СССР. С 1969&nbsp;г. &mdash; член комитета Советского национального объединения истории и философии естествознания и техники. В 1976&ndash;1979&nbsp;гг. &mdash; вице-президент Московского математического общества. С 1969&nbsp;г. &mdash; член комитета Советского национального объединения истории и философии естествознания и техники. С 1976&nbsp;г. &mdash; вице-президент Московского математического общества.</p>

<p>Андрей Андреевич Марков &mdash; яркий представитель группы ученых, творческая деятельность которых развивалась в период становления Математического института им. В.&nbsp;А.&nbsp;Стеклова АН СССР и была ориентирована в значительной степени на развитие новых направлений математики. Своим творчеством не только содействовал укреплению прочных позиций МИАН в топологии, но и выступил создателем новых научных направлений &mdash; теории алгоритмов и конструктивной математики.</p>

<p>Высшим периодом его научной деятельности является последний, длившийся более тридцати лет период интенсивных исследований в области математической логики.</p>

<p>Унаследовал от отца &mdash; А.&nbsp;А.&nbsp;Маркова (старшего) не только любовь к математике, но и настоящее гражданское мужество. Оно было ему надежной основой в период нелегкой борьбы за право кибернетики на самостоятельное развитие и возможность беспрепятственно заниматься связанными с ней научными исследованиями. А.&nbsp;А.&nbsp;Марков (младший) был в числе ученых, много сил отдавших этой нелегкой, но справедливой борьбе и своими научными трудами обеспечивших торжество справедливости.</p>

<p{!! HTML::image('img/library/persons/markov3.jpg', 'markov', array('style' => 'float:left; height:333px; width:485px')) !!}{!! HTML::image('img/library/persons/markov4.jpg', 'markov', array('style' => 'float:left; height:333px; width:152px')) !!}</center></p>

<p>Награжден орденом &quot;Знак почета&quot; (1945), орденом Ленина (1954), орденом Трудового Красного Знамени (1963), медалью &quot;За доблестный труд&quot; (1945) и медалью &quot;За оборону Ленинграда&quot; (1946). Премия им. Чебышева АН СССР (1969).</p>

<p>&nbsp;</p>

			</article></article>	</div></div>
    {!! HTML::script('js/libs/jquery/jquery-1.11.2.min.js') !!}
    {!! HTML::script('js/libs/jquery/jquery-migrate-1.2.1.min.js') !!}
    {!! HTML::script('js/libs/bootstrap/bootstrap.min.js') !!}
    {!! HTML::script('js/libs/spin.js/spin.min.js') !!}
    {!! HTML::script('js/libs/autosize/jquery.autosize.min.js') !!}
    {!! HTML::script('js/libs/nanoscroller/jquery.nanoscroller.min.js') !!}
    {!! HTML::script('js/core/source/App.js') !!}
    {!! HTML::script('js/core/source/AppNavigation.js') !!}
    {!! HTML::script('js/core/source/AppOffcanvas.js') !!}
    {!! HTML::script('js/core/source/AppCard.js') !!}
    {!! HTML::script('js/core/source/AppForm.js') !!}
    {!! HTML::script('js/core/source/AppNavSearch.js') !!}
    {!! HTML::script('js/core/source/AppVendor.js') !!}
    {!! HTML::script('js/core/demo/Demo.js') !!}
    <!-- END JAVASCRIPT -->
</section>
</body>
</html>