<!DOCTYPE html>
<html lang="en">
<head>
    <title>Шеннон</title>

    <!-- BEGIN META -->
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="keywords" content="your,keywords">
    <meta name="description" content="Short explanation about this website">
    <!-- END META -->

    <!-- BEGIN STYLESHEETS -->
    {!! HTML::style('css/bootstrap.css') !!}
    {!! HTML::style('css/materialadmin.css') !!}
    {!! HTML::style('css/font-awesome.min.css') !!}
    {!! HTML::style('css/material-design-iconic-font.min.css') !!}
    <!-- END STYLESHEETS -->

    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    {!! HTML::script('js/libs/utils/html5shiv.js') !!}
    {!! HTML::script('js/libs/utils/respond.min.js') !!}
    <![endif]-->


</head>
<body>
<section>

<div class="col-md-12 col-sm-6 card style-primary text-center">
    <h1 class="text-default-bright">Библиотека</h1>
</div>

<!-- BEGIN CONTENT-->
<div id="content">

    <!-- BEGIN BLANK SECTION -->
    <section>
        <div class="section-header">
            <ol class="breadcrumb">
                <li>{!! HTML::linkRoute('home', 'Главная') !!}</li>
                <li>{!! HTML::linkRoute('library_index', 'Библиотека') !!}</li>
                <li>{!! HTML::linkRoute('library_persons', 'Персоналии') !!}</li>
                <li class="active">Шеннон</li>
            </ol>
        </div><!--end .section-header -->
    </section>
    <div class="card card-tiles style-default-light" style="margin-left:2%; margin-right:2%">
        <article class="style-default-bright">
            <div class="card-body">
	<article class="style-default-bright">
		<div class="card-body"> 
		<article style="margin-left:10%; margin-right:10%; text-align: justify">
			
<p><strong>Клод Шеннон</strong></p>

<p>Клод Э́лвуд Ше́ннон &mdash; американский инженер и математик, его работы являются синтезом математических идей с конкретным анализом чрезвычайно сложных проблем их технической реализации.</p>

<p>Он является основателем теории информации, нашедшей применение в современных высокотехнологических системах связи. Шеннон внес огромный вклад в теорию вероятностных схем, теорию автоматов и теорию систем управления &mdash; области наук, входящие в понятие кибернетика. В 1948 году предложил использовать слово &laquo;бит&raquo; для обозначения наименьшей единицы информации (в статье &laquo;Математическая теория связи&raquo;).</p>

<p>Клод Шеннон родился 30 апреля 1916 года в городе Петоцки, штат Мичиган, США. Первые шестнадцать лет своей жизни Клод провел в Гэйлорде, Мичиган, где в 1932 году он закончил общеобразовательную среднюю школу Гэйлорда. В юности он работал курьером службы Western Union. Отец его был адвокатом и в течение некоторого времени судьей. Его мать была преподавателем иностранных языков и впоследствии стала директором Гэйлордской средней школы. Молодой Клод увлекался конструированием механических и автоматических устройств. Он собирал модели самолетов и радиотехнические цепи, создал радиоуправляемую лодку и телеграфную систему между домом друга и своим домом. Временами ему приходилось исправлять радиостанции для местного универмага. Томас Эдисон был его дальним родственником.</p>

<p>В 1936 г. Клод оканчивает Мичиганский университет, получив степень бакалавра по двум специальностям математика и электротехника, и устраивается в Массачусетский технологический институт, где он работал ассистентом-исследователем на дифференциальном анализаторе Ванневара Буша &mdash; аналоговом компьютере. Изучая сложные, узкоспециальные электросхемы дифференциального анализатора, Шэннон увидел, что концепции Буля могут получить достойное применение. Статья, написанная с его магистерской работы 1937 года &laquo;Символический анализ реле и коммутаторов&raquo;, была опубликована в 1938 году в издании Американского института инженеров-электриков (AIEE). Она также стала причиной вручения Шэннону премии Американского института инженерии имени Альфреда Нобеля в 1940 году. Цифровые цепи &mdash; это основа современной вычислительной техники, таким образом результаты его работ являются одними из наиболее важных научных результатов ХХ столетия. Говард Гарднер из Гарвардского университета отозвался о работе Шэннона, как о &laquo;возможно, самой важной, а также самой известной магистерской работе столетия&raquo;.</p>

<p>Докторская диссертация Шеннона, получившая название &laquo;Алгебра для теоретической генетики&raquo;, была завершена весной 1940 года. Шеннон получает Докторскую степень по математике и степень магистра по электротехнике.</p>

<p>В период с 1941 по 1956 гг. Шеннон преподает в Мичиганском университете и работает в компании Белл (Bell Labs). В лаборатории Белл Шеннон, исследуя переключающие цепи, обнаруживает новый метод их организации, который позволяет уменьшить количество контактов реле, необходимых для реализации сложных логических функций. Он опубликовал доклад, названный &laquo;Организация двухполюсных переключающих цепей&raquo;. Шеннон занимался проблемами создания схем переключения, развил метод, позволяющий создавать схемы, которые были надежнее, чем реле, из которых они были составлены. В конце 1940 года Шеннон получил Национальную научно-исследовательскую премию. Весной 1941 года он вернулся в компанию Белл. С началом Второй мировой войны Т.Фрай возглавил работу над программой для систем управления огнем для противовоздушной обороны. Шеннон работал над устройствами, засекавшими самолеты противника и нацеливавшими зенитные установки, также он разрабатывал криптографические системы, в том числе и правительственную связь, которая обеспечивала переговоры Черчилля и Рузвельта через океан. Как говорил сам Шеннон, работа в области криптографии подтолкнула его к созданию теории информации.</p>

<p>С 1950 по 1956 Шеннон занимался созданием логических машин, таким образом, продолжая начинания фон Неймана и Тьюринга. Он создал машину, которая могла играть в шахматы. В 1952 Шеннон создал обучаемую машину поиска выхода из лабиринта.</p>

<p>Шеннон уходит на пенсию в возрасте пятидесяти лет в 1966 году, но он продолжает консультировать компанию Белл (Bell Labs).</p>

<p>Он был разработчиком первой промышленной игрушки на радиоуправлении, которая выпускалась в 50-ые годы в Японии.</p>

<p>{!! HTML::image('img/library/persons/shennon1.jpg', 'shennon', array('style' => 'float:left; height:320px; width:500px')) !!}</center></p>

<p>Также он разработал устройство, которое могло складывать Кубик Рубика, мини компьютер для настольной игры Гекс, который всегда побеждал соперника, механическую мышку, которая могла находить выход из лабиринта. Так же он реализовал идею шуточной машины &quot;Ultimate Machine&quot;(Абсолютная машина).</p>

<p><br />
<center>{!! HTML::image('img/library/persons/shennon2.jpg', 'shennon', array('style' => 'float:left; height:278px; width:350px')) !!}&nbsp;{!! HTML::image('img/library/persons/shennon3.jpg', 'shennon', array('style' => 'float:left; height:278px; width:350px')) !!}</center></p>

<p>Клод Шеннон ушел из жизни 24 февраля 2001 года.</p>

<p>Теория связи в стойких системах</p>

<p>Работа Шеннона &laquo;Теория связи в секретных системах&raquo; (1945) с грифом секретно, которую рассекретили и опубликовали только лишь в 1949 году, послужила началом обширных исследований в теории кодирования и передачи информации, и, по всеобщему мнению, придала криптографии статус науки. Именно Клод Шеннон впервые начал изучать криптографию, применяя научный подход. В этой статье, Клод определил основополагающие понятия теории криптографии, без которых криптография уже немыслима. Важной заслугой Шеннона является исследования абсолютно стойких систем, и доказательство их существования, а также существование криптостойких шифров, и требуемые для этого условия. Шеннон также сформулировал основные требования, предъявляемые к надежным шифрам. Он ввел ставшие уже привычными понятия рассеивания и перемешивания, и методы создания криптостойких систем шифрования на основе простых операций. Данная статья является отправным пунктом изучения науки криптографии.</p>

<p>Математическая теория связи</p>

<p>Статья &laquo;Математическая теория связи&raquo;, была опубликована в 1948 году и сделала Клода Шеннона всемирно известным. В ней Шеннон изложил свои идеи, ставшие впоследствии основой современных теорий и техник обработки передачи и хранения информации. Результаты его работ в области передачи информации по каналам связи запустили по всему миру огромное число исследований. Шеннон обобщил идеи Хартли и ввел понятие информации, содержащейся в передаваемых сообщениях. В качестве меры информации передаваемого сообщения М, Хартли предложил использовать логарифмическую функцию. Шеннон первым начал рассматривать передаваемые сообщения и шумы в каналах связи с точки зрения статистики, рассматривая как конечные множества сообщений, так и непрерывные множества сообщений. Развитая Шенноном теория информации помогла решить главные проблемы, связанные с передачей сообщений, а именно: устранить избыточность передаваемых сообщений, произвести кодирование и передачу сообщений по каналам связи с шумами. Решение проблемы избыточности подлежащего передаче сообщения позволяет максимально эффективно использовать канал связи. К примеру, современные повсеместно используемые методы снижения избыточности в системах телевизионного вещания на сегодняшний день позволяют передавать до шести цифровых программ коммерческого телевидения, в полосе частот, которую занимает обычный сигнал аналогового телевидения. В своих работах Шеннон доказал принципиальную возможность решения проблем, связанных с передачей сообщений, это явилось в конце 40-х годов настоящей сенсацией в научных кругах. Данная работа, как и работы, в которых исследовалась потенциальная помехоустойчивость, дали начало огромному числу исследований, продолжающихся и по сей день, уже более полувека. Ученые из Советского Союза и США (СССР &mdash; Пинскер, Хинчин, Добрушин, Колмогоров; США- Галлахер, Вольфовиц, Фейнштейн) дали строгую трактовку изложенной Шенноном теории. На сегодняшний день все системы цифровой связи проектируются на основе фундаментальных принципов и законов передачи информации, разработанных Шенноном.</p>

<p>Большое количество исследований было посвящено созданию кодов, устойчивых к помехам, и простых методов декодирования сообщений. Исследования, проведенные за последние пятьдесят лет, легли в основу созданной Рекомендации Международного союза электросвязи по применению помехоустойчивого кодирования и методов кодирования источников информации в современных цифровых системах.</p>

<p>Теорема о пропускной способности канала.</p>

<p>Любой канал с шумом характеризуется максимальной скоростью передачи информации, этот предел назван в честь Шеннона. При передаче информации со скоростями, превышающими этот предел, происходят неизбежные искажения данных, но снизу к этому пределу можно приближаться с необходимой точностью, обеспечивая сколь угодно малую вероятность ошибки передачи информации в зашумленном канале.</p>

<p>Теоремы Шеннона</p>

<li>  Прямая и обратная теоремы Шеннона для источника общего вида &mdash; о связи энтропии источника и средней длины сообщений.</p>

<li>  Прямая и обратная теоремы Шеннона для источника без памяти &mdash; о связи энтропии источника и достижимой степени сжатия с помощью кодирования с потерями и последующего неоднозначного декодирования.</p>

<li>  Прямая и обратная теоремы Шеннона для канала с шумами &mdash; о связи пропускной способности канала и существования кода, который возможно использовать для передачи с ошибкой, стремящейся к нулю (при увеличении длины блока).</p>

<li>  Теорема отсчётов Уиттакера &mdash; Найквиста &mdash; Котельникова &mdash; Шеннона (теорема Котельникова) &mdash; об однозначном восстановлении сигнала по своим дискретным отсчётам.</p>

<li>  Теорема Шеннона об источнике шифрования (или теорема бесшумного шифрования) устанавливает предел максимального сжатия данных и числовое значение энтропии Шеннона.</p>

<li>  Теорема Шеннона-Хартли</p>

			</article></article>	</div></div>
    {!! HTML::script('js/libs/jquery/jquery-1.11.2.min.js') !!}
    {!! HTML::script('js/libs/jquery/jquery-migrate-1.2.1.min.js') !!}
    {!! HTML::script('js/libs/bootstrap/bootstrap.min.js') !!}
    {!! HTML::script('js/libs/spin.js/spin.min.js') !!}
    {!! HTML::script('js/libs/autosize/jquery.autosize.min.js') !!}
    {!! HTML::script('js/libs/nanoscroller/jquery.nanoscroller.min.js') !!}
    {!! HTML::script('js/core/source/App.js') !!}
    {!! HTML::script('js/core/source/AppNavigation.js') !!}
    {!! HTML::script('js/core/source/AppOffcanvas.js') !!}
    {!! HTML::script('js/core/source/AppCard.js') !!}
    {!! HTML::script('js/core/source/AppForm.js') !!}
    {!! HTML::script('js/core/source/AppNavSearch.js') !!}
    {!! HTML::script('js/core/source/AppVendor.js') !!}
    {!! HTML::script('js/core/demo/Demo.js') !!}
    <!-- END JAVASCRIPT -->
</section>
</body>
</html>